#+TITLE: Helloworld
#+DATE: <2016-06-12 Sun>
#+AUTHOR: Kang Tu
#+EMAIL: tninja@Pengs-MacBook-Pro.local
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

* Helloworld

#+name: helloworld
#+begin_src spark-shell :session *spark-shell* :cache no :exports both :results output raw
  sqlContext.sql("SELECT 'helloworld' AS title").show
#+end_src

#+results[c77a424accd8780be0276ed42da70d85f713daa5]: helloworld
Loading /var/folders/16/3zd6s98s3bzccnj2kg8tcmv40000gp/T/scala-eval10729Zms...
+----------+
|     title|
+----------+
|helloworld|
+----------+
